       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMAXX.
      *=================================================================
      *==  AUTOR: Gabriel           EMPRESA: XPTO
      *==  OBJETIVO:
      *==  DATA:
      *==  OBSERVACOES:
      *=================================================================
       ENVIRONMENT           DIVISION.
       CONFIGURATION         SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE       SECTION.


       PROCEDURE             DIVISION.
       0001-PRINCIPAL        SECTION.
           STOP RUN.
           
       0100-INICIALIZAR      SECTION.

       0200-PROCESSAR        SECTION.

       0300-FINALIZAR        SECTION.
           
